code-examples/napojnica-s-elektronickim-potpisom-921-zahtjev.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:tns="http://www.apis-it.hr/fin/2012/types/f73"> 
<soapenv:Header/> 
<soapenv:Body> 
<tns:NapojnicaZahtjev> 
<tns:Zaglavlje> 
<tns:IdPoruke>d121c01c-4351-43f7-8424-289290c69950</tns:IdPoruke> 
<tns:DatumVrijeme>19.07.2023T08:48:13</tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>02994650199</tns:Oib> 
<tns:USustPdv>false</tns:USustPdv> 
<tns:DatVrijeme>19.07.2023T08:48:03</tns:DatVrijeme> 
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
<tns:BrOznRac>235138</tns:BrOznRac> 
<tns:OznPosPr>POSL1</tns:OznPosPr> 
<tns:OznNapUr>12</tns:OznNapUr> 
</tns:BrRac> 
<tns:IznosUkupno>2343.13</tns:IznosUkupno> 
<tns:NacinPlac>G</tns:NacinPlac> 
<tns:OibOper>01234567890</tns:OibOper> 
<tns:ZastKod>a4463353a761769e176b028ccec4382a</tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
<tns:Napojnica> 
<tns:iznosNapojnice>2.00</tns:iznosNapojnice> 
<tns:nacinPlacanjaNapojnice>T</tns:nacinPlacanjaNapojnice> 
</tns:Napojnica> 
</tns:Racun> 
</tns:NapojnicaZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>